# Piping System Type Fluid Temperature Property

Source: https://www.revitapidocs.com/2026/e84eb32b-5a1e-acf3-e765-d484d2d6eee4.htm

---

| Piping System Type Fluid Temperature Property |
| --- |

Fluid Temperature, in Kelvin.
**Namespace:** Autodesk.Revit.DB.Plumbing
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double FluidTemperature { get; set; }
```

```
Public Property FluidTemperature As Double
	Get
	Set
```

```
public:
property double FluidTemperature {
	double get ();
	void set (double value);
}
```

```
member FluidTemperature : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for fluidTemperature is not finite |

Remarks Setter will choose the closest available temperature in settings. See Also

#### Reference

PipingSystemType Class Autodesk.Revit.DB.Plumbing Namespace